#ifndef __PATH_H
#define __PATH_H
#include "main.h"

// 底盘中心离投影中心的距离
#define DUAL_CENTER_DISTANCE 0

// 绕柱弧线圆心离柱子X轴上的距离
#define VERTICAL_DISTANCE_1 108

// 绕柱弧线半径
#define ARC_R_1 775

// 衔接过桥直线弧线半径
#define ARC_R_2 1027.885

// 过桥后1/4圆弧半径
#define ARC_R_3 1225

#define END_X -4500
#define END_Y 8000+ARC_R_3

// 改变离散点数量时记得修改数组大小
PLANNING_PATH DEBUG_PLANNING_PATH[9] = 
{
//	{1, 0, 0, \
//	 0, 0, 0, 1000, \
//	 300, 0, 0, 0, 0, \
//	 0, 0, \
//	 0, 0, -90.0},
	// 起点到第一段绕柱弧线
	{1, 0, 0, \
	 -500, 500, -1225, 1250, \
	 300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},	
	
	// 第一段绕柱弧线
	{0, 0, 0, \
	 -1225+VERTICAL_DISTANCE_1, 2000-DUAL_CENTER_DISTANCE, ARC_R_1, 0, \
	 300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},	

	// 第二段绕柱弧线
	{0, 0, 0, \
	 -1225-VERTICAL_DISTANCE_1, 3500-DUAL_CENTER_DISTANCE, ARC_R_1, 0, \
	 -300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},
	
	// 第三段绕柱弧线（之前圆弧的一半）
	{0, 0, 0, \
	 -1225+VERTICAL_DISTANCE_1, 5000-DUAL_CENTER_DISTANCE, ARC_R_1, 0, \
	 300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},

	// 柱后第一段相切线
	{0, 0, 0, \
	 -1225-(ARC_R_1-VERTICAL_DISTANCE_1)+ARC_R_2, 5000-DUAL_CENTER_DISTANCE, ARC_R_2, 0, \
	 300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},

	// 柱后第二段相切线
	{0, 0, 0, \
	 -1225-ARC_R_2, 6500-DUAL_CENTER_DISTANCE, ARC_R_2, 0, \
	 -300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},	 

	// 过桥的直线
	{1, 0, 0, \
	 -1225, 6500-DUAL_CENTER_DISTANCE, -1225, 8000, \
	 300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},	
	
	// 连接两段直线的1/4圆弧
	{0, 0, 0, \
	 -1225-ARC_R_3, 8000, ARC_R_3, 0, \
	 -300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},

	// 最后一段直线
	{1, 0, 0, \
	 -1225-ARC_R_3, 8000+ARC_R_3, END_X, END_Y, \
	 300, 0, 0, 0, 0, \
	 0, 0, \
	 0, 0, 0},	 	 

//  // 第一代底盘的9s路径
//	{1, 0, 0, -580,       580,  -1225,    1250,  1300, 0, 0, 0, 0, 0, 0},
//	{0, 0, 0, -1117.308,   2000,  757.692, 0,     1300, 0, 0, 0, 0, 0, 0},
//	{0, 0, 0, -1332.692,   3500,  757.692, 0,    -1300, 0, 0, 0, 0, 0, 0},
//	{0, 0, 0, -1117.308,   5000,  757.692, 0,     1300, 0, 0, 0, 0, 0, 0},
//	{0, 0, 0, -847.115,   5000,  1027.885, 0,     1200, 0, 0, 0, 0, 0, 0},
//	{0, 0, 0, -2252.885,  6500,  1027.885, 0,    -1200, 0, 0, 0, 0, 0, 0},
//	{1, 0, 0, -1400,      6080, -1400,    8300,  1500, 0, 0, 0, 0, 0, 0},
//	{0, 0, 0, -2000,      8300,  600,     0,    -1800, 0, 0, 0, 0, 0, 0},
//	{1, 0, 0, -2000,      8900, -4600,    8900,  3000, 0, 0, 0, 0, 0, 0},
};


PLANNING_PATH URTUU_TO_RZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
 
PLANNING_PATH LINE1_TO_RZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH RTUU_TO_RZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH RZ_TO_S1_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH LINE1_TO_S1_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH LINE1_TO_S2_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH LINE1_TO_S3_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH S1_TO_PZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH PZ_TO_TZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH S1_TO_TZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
 
PLANNING_PATH S2_TO_TZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH S3_TO_TZ_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH TZ_TO_S1_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH TZ_TO_S2_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

PLANNING_PATH TZ_TO_S3_PATH[1] =
{{0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
 

#endif


